package com.bn.Sample9_2;

public class ActionGenerator 
{
	static Action[] acArray=new Action[4];
	//跑步
	static {
		acArray[0]=new Action();
		acArray[1]=new Action();
		acArray[2]=new Action();
		acArray[3]=new Action();
		
	int count = 20;
		
	acArray[0].totalStep=count;
	acArray[0].data=new float[][]
	{	
			{1,0,0,0,0,0,0,0f},//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{1,1,10,10,1,0,0},	//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{3,1,-70,0,0.948f,0,0.316f},	//leftTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{5,1,-70,0,-0.948f,0,0.316f},	//rightTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{4,1,-80,-80,0.948f,0,0.316f},//leftTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{6,1,80,80,-0.948f,0,0.316f},//rightTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {7,1,-50,0,1,0,0},	//右大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {9,1,20,0,1,0,0},	//左大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {10,1,0,90,1,0,0},	//左小腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {11,1,10,0,1,0,0},	//leftFoot的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			
	};
	
	acArray[1].totalStep=count;
	acArray[1].data=new float[][]
	{	
			{1,0,0,0,0f,0,0,0},//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{1,1,10,10,1,0,0},		//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{3,1,0,70,0.948f,0,0.316f},		//leftTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {5,1,0,70,-0.948f,0,0.316f},		//rightTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {4,1,-80,-80,0.948f,0,0.316f},	//leftTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {6,1,80,80,-0.948f,0,0.316f},	//rightTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {7,1,0,20,1,0,0},		//右大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {9,1,0,-50,1,0,0},		//左大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {10,1,90,0,1,0,0},		//左小腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {12,1,0,10,1,0,0},//左脚的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 
	};
	
	acArray[2].totalStep=count;
	acArray[2].data=new float[][]
	{		
			{1,0,0,0,0,0,0,0},//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{1,1,10,10,1,0,0},		//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{3,1,70,0,0.948f,0,0.316f},		//leftTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {5,1,70,0,-0.948f,0,0.316f},		//rightTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {4,1,-80,-80,0.948f,0,0.316f},	//leftTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {6,1,80,80,-0.948f,0,0.316f},	//rightTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {7,1,20,0,1,0,0},		//右大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {9,1,-50,0,1,0,0},		//左大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {8,1,0,90,1,0,0},		//右小腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			 {12,1,10,0,1,0,0}	,	//右脚的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
	
	}; 
	acArray[3].totalStep=count;
	acArray[3].data=new float[][]
	{		
			{1,0,0,0,0,0,0,0},//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{1,1,10,10,1,0,0},	//body的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{3,1,0,-70,0.948f,0,0.316f},	//leftTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{5,1,0,-70,-0.948f,0,0.316f},	//rightTop的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{4,1,-80,-80,0.948f,0,0.316f},//leftTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{6,1,80,80,-0.948f,0,0.316f},//rightTopDown的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{7,1,0,-50,1,0,0},	//右大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{9,1,0,20,1,0,0},	//左大腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{8,1,90,0,1,0,0},	//右小腿的动作  部件编号  动作类型（0-平移 1-旋转）起始角度值  结束角度值   旋转轴向量XYZ
			{11,1,0,10,1,0,0},
	};

	}
}